//1. Удаление указанного количества символов из строки 
//Напишите функцию delete_characters(str, length), которая возвращает подстроку, состоящую из указанного количества символов.

let str = 'Каждый охотник желает знать';

function deleteCharacters (str, lenght) {
    return str.slice(0, lenght)
}


console.log(deleteCharacters(str, 10));
//================================================================================================================================================
//Напишите функцию insert_dash(str), которая принимает строку str в качестве аргумента и вставляет тире (-) между словами. При этом все символы строки необходимо перевести в верхний регистр.

let str2 = 'HTML JavaScript PHP';

function insertDash (str) {
    return str.split(' ').join('-');
}

console.log(insertDash(str2));

//================================================================================================================================================
//Напишите функцию, которая принимает строку в качестве аргумента и преобразует регистр первого символа строки из нижнего регистра в верхний.

let str4 = 'string not starting with capital';

function cursiveLetter (str) {
    return str[0].toUpperCase() + str.slice(1);
}

console.log(cursiveLetter(str4));



//================================================================================================================================================
//Напишите функцию capitalize(str), которая возвращает строку, в которой каждое слово начинается с заглавной буквы.

let str5 = "каждый охотник желает знать";

let map = str5.split(' ').map(function(item) {
    return item[0].toUpperCase() + item.slice(1)
});

console.log(map.join(' '));



function capitalize (str) {
    let arr = str.split(' ');
    let newStr = '';
    for (item of arr) {
        newStr += item[0].toUpperCase() + item.slice(1) + ' ';
    }
    return newStr;
}

console.log(capitalize(str5));

//================================================================================================================================================
//Напишите функцию change_register(str), которая принимает в качестве аргумента строку и и заменяет регистр каждого символа на противоположный. Например, если вводится «КаЖдЫй ОхОтНиК», то на выходе должно быть «кАжДыЙ оХоТнИк».

let str6 = 'КаЖдЫй ОхОтНиК жЕлАеТ зНаТь';

function changeRegister(str) {
    let newStr = '';
    for (let i = 0; i < str.lenght; i++) {
        
    }

}

console.log(changeRegister(str6));